t = int(input("เลือกชนิดของรูป: "))
if t == 1 :
    print('คุณเลือกพื้นที่สามเหลี่ยม')
    r = int(input("ใส่รัศมี: "))
    pi = 3.14
    w = input('ต้องการหาพื้นที่ หรือเส้นรอบวง: ')
    if w == 'a':
        num1 = r**2
        re = 2*pi*num1
        print("พื้นที่วงกลมคือ %.2f" %re)
    elif w == 'b':
        re = 2*pi*r
        print("เส้นรอบวงกลมคือ %.2f" %re)
elif t == 2 :
    print('คุณเลือกพื้นที่สี่เหลี่ยมจัสตุรัส')
    h = int(input("ใส่ความยาวเส้นของพื้นที่สี่เหลี่ยมจัสตุรัส: ")) 
    w = input('ต้องการหาพื้นที่ หรือความยาวรอบรูป: ')
    if w == 'a':
        re = h*h
        print("พื้นที่สี่เหลี่ยมจัตุรัสคือ %.2f" %re)
    elif w == 'b':
        re = h*4
        print("ความยาวรอบรูปของสี่เหลี่ยมคือ %.2f" %re)
elif t == 3:
    print('คุณเลือกสามเหลี่ยมด้านเท่า')
    l = int(input('ใส่ความยาวของสามเหลี่ยมด้านเท่า: '))
    w = input('ต้องการหาพื้นที่ หรือความยาวรอบรูป: ')
    if w == 'a':
        ll = l*2
        re = 0.433*ll
        print('พื้นที่ของสามเหลี่ยมด้านเท่าคือ %.2f'%re)
    elif w == 'b':
        re = 3*l
        print('เส้นรอบรูปคือ %.2f'%re)